#Область ОбработчикиСобытий
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Документ.итПриемка.Форма.ФормаДокумента",новый Структура("Ключ",Элемент.ТекущиеДанные.Ссылка),ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	 Если ИмяСобытия="ОбновлениеДанныхДинамическихСписков" и Источник=ОбщийМодульКлиентскойЧасти тогда
		Элементы.Список.Обновить();
	 КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКоманд
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
#КонецОбласти
