
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("Ссылка") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;	
	Данные=Параметры.Ссылка.СтруктураКраткогоСодежимого.Получить();
	Если Данные=Неопределено Тогда 
		Отказ=Истина;
		Возврат
    КонецЕсли;		
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Данные);
КонецПроцедуры
