
&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;
		//ЧастьСтрокиЛевая=Лев(Параметр,12);
		//Центр=СтрЗаменить(Сред(Параметр,14,2),"02","04");
		//ЧастьСтрокиПравая=Прав(Параметр,11);
		//Параметр=ЧастьСтрокиЛевая+"1"+Центр+ЧастьСтрокиПравая;
		ОбработчикШтрихКода(Параметр);
	КонецЕсли;	
	//ПроверитьШтрихКодНаФормат(Параметр);
КонецПроцедуры
&НаКлиенте
Процедура ОбработчикШтрихКода(Параметр)
ШтрихКод=Параметр;
Отказ=Ложь;
ЭтоGTIN=Истина;
ЭтоSSCC=Ложь;
//СлужебныеФункцииИПроцедурыКлиентСервер.ПроверитьGTINНаЛеквидность(Параметр,Отказ,Ложь);
//Если не Отказ Тогда 
//	ЭтоGTIN=Истина;
//Иначе 
//	Отказ=Ложь;
//	СлужебныеФункцииИПроцедурыКлиентСервер.ПроверитьSSCCНаЛеквидность(Параметр,Отказ,Ложь);
//	Если не Отказ Тогда 
//		ЭтоSSCC=Истина;
//	КонецЕсли;
//КонецЕсли;
Если ЭтоGTIN или ЭтоSSCC Тогда 
	СтруктураДанных=новый Структура;
	СтруктураДанных.Вставить("КлючОперации","ПолучитьДанныеМарокИНоменклатурыПоSSCCGTIN");
	СтруктураДанных.Вставить("ШтрихКод",Параметр);
	СтруктураДанных.Вставить("ЭтоGTIN",ЭтоGTIN);
    СтруктураДанных.Вставить("ЭтоSSCC",ЭтоSSCC);
    СтруктураДанных=ЗапроситьДанныеНаСервере(СтруктураДанных);	
	Если СтруктураДанных<> Неопределено Тогда 
		ОповеститьОВыборе(СтруктураДанных);
	КонецЕсли;	
КонецЕсли;
	КонецПроцедуры
&НаСервере
Функция ЗапроситьДанныеНаСервере(СтруктураДанных)
	СтруктураДанных=ОбработчикиЗапросаСервера.ЗапроситьДанные(СтруктураДанных,"ServiceFunction");
	Если СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных,"МассивМарок") тогда
		Возврат	Неопределено;
	КонецЕсли;
    Возврат СтруктураДанных;
	КонецФункции