
&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	Если Пароль="66613" тогда
		Элементы.ДоступКФорме.Видимость=Ложь;
		Элементы.ФункциональнаяГруппа.Видимость=Истина;
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ФункциональнаяГруппа.Видимость=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБД(Команда)
	Оповещение = новый ОписаниеОповещения("ОчиститьБДоповещение",ЭтаФорма);
	ПоказатьВопрос(Оповещение,"Последствия будут необратимы, вы точно хотите очистить бд терминала?",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры
&НаКлиенте
Процедура ОчиститьБДоповещение(Результат,Параметры) Экспорт 
	Если Результат=КодВозвратаДиалога.Нет тогда
		Возврат
	КонецЕсли;	
	ОчиститьБДНаСервере();
КонецПроцедуры
&НаСервере
Процедура ОчиститьБДНаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИтЗадачиНаТСД.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	РегистрСведений.ИтЗадачиНаТСД КАК ИтЗадачиНаТСД
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтЗадачиНаТСД.ДокументОснование";
	
	РезультатЗапроса = Запрос.Выполнить();
	МассивДокументов=РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ДокументОснование");
	
	НаборЗаписей=РегистрыСведений.ИтСтрокиЗадачНаТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.ИтЗадачиНаТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.итДанныеПомарочногоУчета.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();

	
	для Каждого Документ из МассивДокументов цикл
		ОбработчикДанныхОбщиеФункцииИПроцедуры.ПроверитьУдалитьДокумент(Документ,"");
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры
