&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;	
		 ОбработчкаПолученияДанныхШтрихКода(Параметр);
	 КонецЕсли;
 КонецПроцедуры
 
&НаКлиенте
Процедура ОбработчкаПолученияДанныхШтрихКода(Параметр)
	Если Элементы.Хелпер.Заголовок="Сканируйте штрих-код для определения карточки номенклатуры" Тогда 
		ЗапроситьДанныеНмПоШтрихКоду(Параметр);
		Возврат;
	КонецЕсли;
	Если СтрДлина(Параметр)=13 Тогда 
		ТипШтрихКода="EAN13";
		ПрисваемыйШтрихКод=Параметр;
		Элементы.Присвоить.Видимость=Истина;
		Элементы.Хелпер.Заголовок="";
	ИначеЕсли СтрДлина(Параметр)=14 Тогда 
		ТипШтрихКода="ITF14";
		ПрисваемыйШтрихКод=Параметр;
		Элементы.Присвоить.Видимость=Истина;
		Элементы.Хелпер.Заголовок="";
	КонецЕсли;
	КонецПроцедуры

&НаСервере	
Процедура ЗапроситьДанныеНмПоШтрихКоду(Параметр)
	СтруктураДанных=новый Структура;
	СтруктураДанных.Вставить("КлючОперации","ПолучитьКарточкиНоменклатур");
	СтруктураДанных.Вставить("ШтрихКод",Параметр);
	СтруктураДанных=ОбработчикиЗапросаСервера.ЗапроситьДанные(СтруктураДанных,"ServiceFunction");
	Если СтруктураДанных.МассивКарточек.Количество()=0 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ошибка поиска");
		Возврат
	КонецЕсли;	
	Для Каждого стр из СтруктураДанных.МассивКарточек цикл
		Элементы.НоменклатураПредставление.СписокВыбора.Добавить(Строка(стр.Номенклатура),стр.НоменклатураПредставление);
	КонецЦикла;
	НоменклатураПредставление= Строка(СтруктураДанных.МассивКарточек[0].Номенклатура);
	Номенклатура=СтруктураДанных.МассивКарточек[0].Номенклатура;
    Элементы.Хелпер.Заголовок="Сканируйте штрих-код для присвоения";
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПредставлениеПриИзменении(Элемент)
	Номенклатура=новый УникальныйИдентификатор(НоменклатураПредставление);
КонецПроцедуры

&НаСервере
Функция  ПрисвоитьНаСервере()
    СтруктураДанных=новый Структура;
	СтруктураДанных.Вставить("КлючОперации","ПрисвоитьШтрихКодКарточкеНМ");
	СтруктураДанных.Вставить("ШтрихКод",ПрисваемыйШтрихКод);
	СтруктураДанных.Вставить("Номенклатура",Номенклатура);
	СтруктураДанных.Вставить("ТипШтрихКода",ТипШтрихКода);
	СтруктураДанных.Вставить("ТригерИсполнения",Ложь);
    СтруктураДанных=ОбработчикиЗапросаСервера.ЗапроситьДанные(СтруктураДанных,"ServiceFunction");
	Возврат СтруктураДанных.ТригерИсполнения;
	
КонецФункции

&НаКлиенте
Процедура Присвоить(Команда)
	Если ПрисвоитьНаСервере() Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
