
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("ИдЗадачи") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;
    Если не Параметры.Свойство("МассивИдСтрокКПросмотру") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;	
    МассивВизуализации=ПолучитьМассивДанныхКПросмотру(Параметры.ИдЗадачи,Параметры.МассивИдСтрокКПросмотру);
	Счетчик=0;
	Для Каждого Стр из МассивВизуализации Цикл
		СчетчикСтрокой=Строка(Счетчик);
		СозданиеРеквизитовИЭлементовФормы(СчетчикСтрокой,Стр);
		ЭтаФорма["Номенклатура"+СчетчикСтрокой]=Стр.Номенклатура;
		ЭтаФорма["СерияНоменклатуры"+СчетчикСтрокой]=Стр.СерияНоменклатуры;
        ЭтаФорма["Количество"+СчетчикСтрокой]=Стр.Количество;
		Счетчик=Счетчик+1;
	КонецЦикла;
КонецПроцедуры
&НаСервере
Процедура СозданиеРеквизитовИЭлементовФормы(Счетчик,Данные)
НоваяСтраница=Элементы.Добавить("Страница"+Счетчик,Тип("ГруппаФормы"),Элементы.Страницы);
НоваяСтраница.Вид=ВидГруппыФормы.Страница;
НоваяСтраница.РастягиватьПоГоризонтали=Истина;
НоваяСтраница.РастягиватьПоВертикали=Истина;
ДобавляемыеРеквизиты=новый Массив;
Реквизит = Новый РеквизитФормы("Номенклатура"+Счетчик,ОпределеитьОписаниеТипа("Строка"),,"Номенклатура",Ложь);
ДобавляемыеРеквизиты.Добавить(Реквизит);
Реквизит = Новый РеквизитФормы("СерияНоменклатуры"+Счетчик,ОпределеитьОписаниеТипа("Строка"),,"СерияНоменклатуры",Ложь);
ДобавляемыеРеквизиты.Добавить(Реквизит);
Реквизит = Новый РеквизитФормы("Количество"+Счетчик,ОпределеитьОписаниеТипа("Число"),,"Количество",Ложь);
ДобавляемыеРеквизиты.Добавить(Реквизит);
ИзменитьРеквизиты(ДобавляемыеРеквизиты);
ТекущийЭлементДобавления=Элементы.Добавить("Номенклатура"+Счетчик,Тип("ПолеФормы"),НоваяСтраница);
ТекущийЭлементДобавления.ПутьКДанным="Номенклатура"+Счетчик;
ТекущийЭлементДобавления.Вид=ВидПоляФормы.ПолеВвода;
ТекущийЭлементДобавления.МногострочныйРежим=Истина;   
ТекущийЭлементДобавления.ТолькоПросмотр=Истина;

ТекущийЭлементДобавления=Элементы.Добавить("СерияНоменклатуры"+Счетчик,Тип("ПолеФормы"),НоваяСтраница);
ТекущийЭлементДобавления.ПутьКДанным="СерияНоменклатуры"+Счетчик;
ТекущийЭлементДобавления.Вид=ВидПоляФормы.ПолеВвода;
ТекущийЭлементДобавления.МногострочныйРежим=Истина;   
ТекущийЭлементДобавления.ТолькоПросмотр=Истина;

ТекущийЭлементДобавления=Элементы.Добавить("Количество"+Счетчик,Тип("ПолеФормы"),НоваяСтраница);
ТекущийЭлементДобавления.ПутьКДанным="Количество"+Счетчик;
ТекущийЭлементДобавления.Вид=ВидПоляФормы.ПолеНадписи;


	
КонецПроцедуры
&НаСервере	
Функция ОпределеитьОписаниеТипа(Типы)
	МассивТипов=новый Массив;
	Если ТипЗнч(Типы)<>Тип("Массив") Тогда 
		МассивТипов.Добавить(Типы);
	иначе
		МассивТипов=Типы;
	КонецЕсли;
	СтрокаТипов="";
	Для Каждого стр из МассивТипов цикл
		Если СтрокаТипов="" Тогда 
			СтрокаТипов=СтрокаТипов+стр;
		иначе
			СтрокаТипов=СтрокаТипов+","+стр;
		КонецЕсли;	
	КонецЦикла;
	Возврат новый ОписаниеТипов(СтрокаТипов,,,новый КвалификаторыЧисла(15,3),новый КвалификаторыСтроки(255),новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));		
КонецФункции
&НаСервере
Функция ПолучитьМассивДанныхКПросмотру(ИдЗадачи,МассивИдСтрокКПросмотру)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИтСтрокиЗадачНаТСД.НоменклатураПредставление КАК НоменклатураПредставление,
		|	ИтСтрокиЗадачНаТСД.СерияНоменклатурыПредставление КАК СерияНоменклатурыПредставление,
		|	ИтСтрокиЗадачНаТСД.СерияНоменклатуры КАК СерияНоменклатуры,
		|	СУММА(ИтСтрокиЗадачНаТСД.Количество) КАК Количество
		|ИЗ
		|	РегистрСведений.ИтСтрокиЗадачНаТСД КАК ИтСтрокиЗадачНаТСД
		|ГДЕ
		|	ИтСтрокиЗадачНаТСД.ИдЗадачи = &ИдЗадачи
		|	И ИтСтрокиЗадачНаТСД.ИдСтроки В(&МассивИдСтрокКПросмотру)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтСтрокиЗадачНаТСД.НоменклатураПредставление,
		|	ИтСтрокиЗадачНаТСД.СерияНоменклатурыПредставление,
		|	ИтСтрокиЗадачНаТСД.СерияНоменклатуры";
	
	Запрос.УстановитьПараметр("ИдЗадачи", ИдЗадачи);
	Запрос.УстановитьПараметр("МассивИдСтрокКПросмотру", МассивИдСтрокКПросмотру);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивВизуализации=новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураДанных=новый Структура;
		СтруктураДанных.Вставить("Номенклатура",ВыборкаДетальныеЗаписи.НоменклатураПредставление);
		СтруктураДанных.Вставить("СерияНоменклатуры",ВыборкаДетальныеЗаписи.СерияНоменклатурыПредставление);
        СтруктураДанных.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество);
		МассивВизуализации.Добавить(СтруктураДанных);
	КонецЦикла;
    Возврат МассивВизуализации;	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	КонецФункции
&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры
