
Процедура ПриНачалеРаботыСистемы()
	#Если МобильноеПриложениеКлиент  тогда
	//28.04.2020  переход на native  компоненту 
	// компонента подключается в начале в форме авторизации, а после авторизация в форме рабочего стола.
	//МодульМобильныхДивайсовКлиент.ПодключитьОбработчикШтрихКода();
	//Если ПодключитьВнешнююКомпоненту("ОбщийМакет.AddIn", "Demo", ТипВнешнейКомпоненты.Native) Тогда
	//Компонента = Новый("AddIn.Demo.AddInNativeBEN");
	//КонецЕсли;
	//МодульМобильныхДивайсовКлиент.УстановкаДрайверов();
#КонецЕсли
ОткрытьФорму("ОбщаяФорма.ФормаАвторизации");
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	Если Данные="" Тогда 
		Возврат
	КонецЕсли;	
	МодульМобильныхДивайсовКлиент.ОбработчикВнешнихСобытийМобильнойКомпоненты(Источник, Событие, Данные);
КонецПроцедуры

Процедура ПередНачаломРаботыСистемы(Отказ)
	СлужебныеФункцииИПроцедурыКлиентСервер.ОчиститьВсеХранилищаПриОткрытииПрограммы();
КонецПроцедуры
