
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
СерийныйНомер=Константы.СерийныйНомерТСД.Получить();
#Если  МобильноеПриложениеСервер тогда
СистемнаяИнформация=новый СистемнаяИнформация;	
ПараметрыСеанса.ТСДИД=?(СерийныйНомер="",Строка(СистемнаяИнформация.ИдентификаторКлиента),СерийныйНомер);
ПараметрыСеанса.ТекущийПользователь="";
ПараметрыСеанса.Принтер="";
ПараметрыСеанса.Роль="";
ПараметрыСеанса.Территория="";
ПараметрыСеанса.униРежимПодключенияЧерезUWS = Ложь;
ПараметрыСеанса.ДатаВремяСервера='00010101';
ПараметрыСеанса.ВременнаяРазница=0;
#Иначе
ГУИД = Константы.УникальныйИдентификаторТСД.Получить();
Если ГУИД="" тогда
ГУИД= новый УникальныйИдентификатор;
ГУИД=Строка(ГУИД);
Константы.УникальныйИдентификаторТСД.Установить(ГУИД);
КонецЕсли;
ПараметрыСеанса.ТСДИД=ГУИД;
ПараметрыСеанса.ТекущийПользователь="";
ПараметрыСеанса.униРежимПодключенияЧерезUWS = Ложь;
#КонецЕсли
КонецПроцедуры
