
&НаКлиенте
Процедура Удалить(Команда)
	Если ТекущийЭлемент.Имя="ТаблицаСканированныхДанных" тогда
		ИдентификаторОбработки=ТекущийЭлемент.ТекущиеДанные.ПолучитьИдентификатор();
		Строка=ТаблицаСканированныхДанных.НайтиПоИдентификатору(ИдентификаторОбработки);
		ТаблицаСканированныхДанных.Удалить(Строка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСерверНаСервере()
СтруктураДанных=новый Структура;
	СлужебныеФункцииИПроцедурыКлиентСервер.СформироватьСтруктуруДанныхОПользователе(СтруктураДанных);
	СтруктураДанных.Вставить("КлючОперации","СканированиеШтрихКодовВТаблицу");
	СтруктураДанных.Вставить("Данные",ТаблицаСканированныхДанных.Выгрузить());
	СтруктураДанных=ОбработчикиЗапросаСервера.ЗапроситьДанные(СтруктураДанных,"ServiceFunction");
	Если 	СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных,"ИмяФайлаНаСервере") тогда
		Возврат
	КонецЕсли;	
   ИмяФайлаНаСервере=СтруктураДанных.ИмяФайлаНаСервере;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСервер(Команда)
	ОтправитьНаСерверНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;
	НоваяСтрока=ТаблицаСканированныхДанных.Добавить();
	НоваяСтрока.СканированныйШтрихКод=Параметр;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры
