
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не  Параметры.Свойство("ОбъектНаборки") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;
	Принтер=ПараметрыСеанса.Принтер;
	Объект=Параметры.ОбъектНаборки;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;	
		 ОбработчкаПолученияДанныхШтрихКода(Параметр);
	 КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработчкаПолученияДанныхШтрихКода(ШтрихКод)
	УстановитьПринтерДляПечатиПоШтрихКоду(ШтрихКод);
КонецПроцедуры
&НаСервере
Процедура УстановитьПринтерДляПечатиПоШтрихКоду(ШтрихКод)
	СтруктураДанных=новый Структура;
	СлужебныеФункцииИПроцедурыКлиентСервер.СформироватьСтруктуруДанныхОПользователе(СтруктураДанных);
	СтруктураДанных.Вставить("КлючОперации","ПринтерПоШтрихКоду");
	СтруктураДанных.Вставить("Данные",НРег(ШтрихКод));
	СтруктураДанных=ОбработчикиЗапросаСервера.ЗапроситьДанные(СтруктураДанных,"ServiceFunction");
	Если 	СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных,"ТекущийПринтерПредставление") тогда
		Возврат
	КонецЕсли;
	Если 	СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных,"ТекущийПринтер") тогда
		Возврат
	КонецЕсли;
	Принтер=СтруктураДанных.ТекущийПринтерПредставление;
	КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИтЗадачиНаТСД.ИдентификаторУпаковки КАК ИдентификаторУпаковки
		|ИЗ
		|	РегистрСведений.ИтЗадачиНаТСД КАК ИтЗадачиНаТСД
		|ГДЕ
		|	ИтЗадачиНаТСД.ДокументОснование = &ДокументОснование
		|	И ПОДСТРОКА(ИтЗадачиНаТСД.ИдентификаторУпаковки, 1, 12) = ПОДСТРОКА(ИтЗадачиНаТСД.ДокументОснование.FSRARID, 1, 12)";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СтруктураДанных=новый Структура;
	СлужебныеФункцииИПроцедурыКлиентСервер.СформироватьСтруктуруДанныхОПользователе(СтруктураДанных);
	СтруктураДанных.Вставить("КлючОперации","ПечатьSSCC");
	СтруктураДанных.Вставить("Принтер",Принтер);
	СтруктураДанных.Вставить("ИдентификаторУпаковки",ВыборкаДетальныеЗаписи.ИдентификаторУпаковки);
	СтруктураДанных=ОбработчикиЗапросаСервера.ЗапроситьДанные(СтруктураДанных,"ServiceFunction");
	СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных);
	КонецЦикла;
	


КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
ПечатьНаСервере();
ЭтаФорма.Закрыть();
КонецПроцедуры
