

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("ИдентификаторУпаковкиПолучатель") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;	
	Если не Параметры.Свойство("ШтрихКодЯчейкиПолучатель") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;	
	Если не Параметры.Свойство("ЯчейкаПолучатель") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;	
	Если не Параметры.Свойство("ЯчейкаПолучательПредставление") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;	
    ИдентификаторУпаковкиПолучатель=Параметры.ИдентификаторУпаковкиПолучатель;
	ШтрихКодЯчейкиПолучатель=Параметры.ИдентификаторУпаковкиПолучатель;
	ЯчейкаПолучатель=Параметры.ЯчейкаПолучатель;
	ЯчейкаПолучательПредставление=Параметры.ЯчейкаПолучательПредставление;


КонецПроцедуры
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;	
		ОбработчкаПолученияДанныхШтрихКода(Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчкаПолученияДанныхШтрихКода(Параметр)
	Если Элементы.ДекорацияНадписьЭтапа.Заголовок="Сканируйте ячейку получатель" Тогда
		Если СокрЛП(НРег(Параметр))=СокрЛП(НРег(ШтрихКодЯчейкиПолучатель)) Тогда
			Элементы.ДекорацияНадписьЭтапа.Заголовок="Сканируйте SSCC Получатель";
			Элементы.ДекорацияНадписьЭтапа.ЦветТекста=WebЦвета.КрасноФиолетовый;
		ИначеЕсли ШтрихКодНакопленВерно(Параметр) тогда
			Элементы.ДекорацияНадписьЭтапа.Заголовок="Сканируйте SSCC Получатель";
			Элементы.ДекорацияНадписьЭтапа.ЦветТекста=WebЦвета.КрасноФиолетовый;
        ИначеЕсли  ЭтапСканированияЯчейки<1 тогда 
			ЭтапСканированияЯчейки=1;
			НакопительСканированияЯчейки=Параметр;
		иначе
			НакопительСканированияЯчейки="";
			ЭтапСканированияЯчейки=0;
			Сообщить("Не верное сканирование ячейки получатель");
		КонецЕсли;

	КонецЕсли;
	Если Элементы.ДекорацияНадписьЭтапа.Заголовок="Сканируйте SSCC Получатель" Тогда
		Если СокрЛП(НРег(Параметр))=СокрЛП(НРег(ИдентификаторУпаковкиПолучатель)) Тогда 
			ВладелецФормы.АварийноеЗавершениеЗадачи();
			ЭтаФорма.Закрыть();
		иначе
			Сообщить("Не верный SSCC Получатель");
		КонецЕсли;	
    КонецЕсли;
	КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторУпаковкиПолучательОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("ОбщаяФорма.ВыборПринтераДляПечати",новый Структура("ИдентификаторУпаковки",ИдентификаторУпаковкиПолучатель),ЭтаФорма);
	ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры
&НаКлиенте
Функция ШтрихКодНакопленВерно(Параметр)
	Если НРег(СокрЛП(НакопительСканированияЯчейки)+СокрЛП(Параметр))=НРег(СокрЛП(ШтрихКодЯчейкиПолучатель)) тогда
		Возврат Истина;
	ИначеЕсли  НРег(СокрЛП(НакопительСканированияЯчейки)+"-"+СокрЛП(Параметр))=НРег(СокрЛП(ШтрихКодЯчейкиПолучатель)) тогда
		Возврат Истина;
	ИначеЕсли НРег(СокрЛП(Параметр)+"-"+СокрЛП(НакопительСканированияЯчейки))=НРег(СокрЛП(ШтрихКодЯчейкиПолучатель)) тогда
		Возврат Истина;
	ИначеЕсли НРег(СокрЛП(Параметр)+СокрЛП(НакопительСканированияЯчейки))=НРег(СокрЛП(ШтрихКодЯчейкиПолучатель)) тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
