Процедура ПолучитьИнформациюПоИДУпаковки(ШтрихКод,Инфо) Экспорт

	СтруктураЗапроса = униОбщийМодуль.НоваяСтруктураЗапросакUWS("200000010");
	СтруктураЗапроса.Вставить("ШтрихКод",ШтрихКод);
	СтруктураЗапроса.Вставить("ТипИд",униОбщийМодуль.ОпрределитьТипСчитанногоШК(ШтрихКод));

	СтруктураЗапроса.Вставить("ИмяМетода","ПолучитьИнформациюПоИДУпаковки");

	Попытка
		ОтветСервера =  униОбщийМодуль.ДанныеИзUWS(СтруктураЗапроса);
	Исключение
		УспехАвторизации = Ложь;
		ОтветСервера = "Ошибка";
		сообщить(ОписаниеОшибки());
	КонецПопытки; 
	

	Если ТипЗнч(ОтветСервера) = Тип("Структура") Тогда
		Если ОтветСервера.Свойство("Номенклатура") Тогда
		     КодУпаковки = ОтветСервера.КодУпаковки;
			 НомекнлатураНаименование = ОтветСервера.Номенклатура;
			 ДатаПроизводства = ОтветСервера.ДатаПроизводства;
			 НоменклатураУИД = ОтветСервера.ИДНоменклатуры;
			 ИТПУИД = ОтветСервера.ИДИТП;
			 Количество = ОтветСервера.Количество;
		иначе	
		     Инфо = Инфо+" Не найден код упаковки. Проведите документ палетизация";
			 КодУпаковки = "";
			 НомекнлатураНаименование ="";
			 ДатаПроизводства = Дата(1,1,1);
			 ИТПУИД = Новый УникальныйИдентификатор();
			 НоменклатураУИД = Новый УникальныйИдентификатор();
			 Количество = 0;
		КонецЕсли; 
		 
	КонецЕсли;

КонецПроцедуры
 

Процедура ПоместитьВЯчейку(Информация1,Инфо) Экспорт
    Записать();
	СтруктураЗапроса = униОбщийМодуль.НоваяСтруктураЗапросакUWS("200000010");
	Информация1.Вставить("УидДокумента",Ссылка.УникальныйИдентификатор());
	СтруктураЗапроса.Вставить("Информация1",Информация1);

	СтруктураЗапроса.Вставить("ИмяМетода","ПоместитьВЯчейку");
	СтруктураЗапроса.Вставить("Автор",ПараметрыСеанса.ТекущийПользовательУИД);
    Ячейка = Информация1.Ячейка;
	Попытка
		ОтветСервера =  униОбщийМодуль.ДанныеИзUWS(СтруктураЗапроса);
	Исключение
		УспехАвторизации = Ложь;
		ОтветСервера = "Ошибка";
		сообщить(ОписаниеОшибки());
	КонецПопытки; 
	

	Если ТипЗнч(ОтветСервера) = Тип("Структура") Тогда
		  Инфо =  ОтветСервера.инфо;
	      ОперацияПроведена = ОтветСервера.Успех;
	      //Записать();	
	КонецЕсли;
   
КонецПроцедуры
 