Процедура ПроверитьНаборкуНаСервере() Экспорт
	ФСтр = "";
	Для каждого Тек Из Наборка Цикл
		Если ПустаяСтрока(Тек.КодЭлементаУчета) Тогда
			
			продолжить;
			
		КонецЕсли; 
		Если униОбщийМодуль.ОпрределитьТипСчитанногоШК(Тек.КодЭлементаУчета) = "Прочий" Тогда
			
			Продолжить;
			
		КонецЕсли; 
		Фстр = Фстр + ?(ПустаяСтрока(Фстр),"",Символы.ПС)+тек.КодЭлементаУчета;
	КонецЦикла; 
	
	СтруктураЗапроса = униОбщийМодуль.НоваяСтруктураЗапросакUWS();
	СтруктураЗапроса.Вставить("КодыНаборки",Фстр);
	
	СтруктураЗапроса.Вставить("ИмяМетода","ПолучитьДанныеНаборки");
	СтруктураЗапроса.Вставить("ГУИД",ТТНЕГАИС);
	
	Попытка
		ОтветСервера =  униОбщийМодуль.ДанныеИзUWS(СтруктураЗапроса);
	Исключение
		УспехАвторизации = Ложь;
		ОтветСервера = "Ошибка";
	КонецПопытки; 
	
	Если ТипЗнч(ОтветСервера) = Тип("Структура") Тогда
		Если ОтветСервера.Свойство("Товары") Тогда
			
			Товары.Загрузить(ОтветСервера.Товары);
			
		КонецЕсли; 
		Если ОтветСервера.Свойство("Наборка") Тогда
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Наборка.Идентификатор КАК Идентификатор,
			|	Наборка.Количество КАК Количество
			|ПОМЕСТИТЬ Т1
			|ИЗ
			|	&Наборка КАК Наборка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НаборкаЛокально.КодЭлементаУчета КАК КодЭлементаУчета,
			|	НаборкаЛокально.Количество КАК Количество,
			|	НаборкаЛокально.КодКороба КАК КодКороба,
			|	НаборкаЛокально.КодФСМ КАК КодФСМ,
			|	НаборкаЛокально.КонтрольПоЭлементам КАК КонтрольПоЭлементам
			|ПОМЕСТИТЬ Т2
			|ИЗ
			|	&НаборкаЛокально КАК НаборкаЛокально
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Т2.КодЭлементаУчета КАК КодЭлементаУчета,
			|	ЕСТЬNULL(Т1.Количество, 0) КАК Количество,
			|	Т2.КодКороба КАК КодКороба,
			|	Т2.КодФСМ КАК КодФСМ,
			|	Т2.КонтрольПоЭлементам КАК КонтрольПоЭлементам
			|ИЗ
			|	Т2 КАК Т2
			|		ЛЕВОЕ СОЕДИНЕНИЕ Т1 КАК Т1
			|		ПО Т2.КодЭлементаУчета = Т1.Идентификатор";
			
			Запрос.УстановитьПараметр("Наборка",ОтветСервера.Наборка);
			Запрос.УстановитьПараметр("НаборкаЛокально",Наборка.Выгрузить());
			РезультатЗапроса = Запрос.Выполнить();
			
			
			
			Наборка.Загрузить(РезультатЗапроса.Выгрузить());
			
		КонецЕсли; 
		КодификаторТАбДок ="";
		СвойствоКодификатораЕсть =  ОтветСервера.Свойство("Кодификатор",КодификаторТАбДок);
		Если СвойствоКодификатораЕсть Тогда
			КодификаторТабХЗ = Новый ХранилищеЗначения(КодификаторТАбДок);	
			Если КодификаторТАбДок.ВысотаТаблицы > 0 Тогда
				
				КодификаторПолучен = Истина;
				Записать();
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

 


Процедура ВыгрузитьНаборкуНаСервере(СообщениеО)  Экспорт
	ФСтр = "";
	Для каждого Тек Из Наборка Цикл
		Если ПустаяСтрока(Тек.КодЭлементаУчета) Тогда
			
			продолжить;
			
		КонецЕсли; 
		Если униОбщийМодуль.ОпрределитьТипСчитанногоШК(Тек.КодЭлементаУчета) = "Прочий" Тогда
			Продолжить;
		КонецЕсли; 
		Фстр = Фстр + ?(ПустаяСтрока(Фстр),"",Символы.ПС)+тек.КодЭлементаУчета;
	КонецЦикла; 
	СтруктураЗапроса = униОбщийМодуль.НоваяСтруктураЗапросакUWS();
	СтруктураЗапроса.Вставить("КодыНаборки",Фстр);
	СтруктураЗапроса.Вставить("УИД",Ссылка.УникальныйИдентификатор());
	СтруктураЗапроса.Вставить("КодыМасивом",Наборка.ВыгрузитьКолонку("КодЭлементаУчета"));
	СтруктураЗапроса.Вставить("ИмяМетода","ВыгрузитьДанныеНаборки");
	СтруктураЗапроса.Вставить("Автор",ПараметрыСеанса.ТекущийПользовательУИД);
	СтруктураЗапроса.Вставить("ГУИД",ТТНЕГАИС);
	
	Попытка
		ОтветСервера =  униОбщийМодуль.ДанныеИзUWS(СтруктураЗапроса);
	Исключение
		УспехАвторизации = Ложь;
		ОтветСервера = "Ошибка";
	КонецПопытки; 
	
	Если ТипЗнч(ОтветСервера) = Тип("Структура") Тогда
		Если ОтветСервера.Свойство("ОтветРезультат") Тогда
			СообщениеО = ОтветСервера.ОтветРезультат;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

Функция ТабДокСервере() Экспорт

	  Возврат  КодификаторТабХЗ.Получить();

КонецФункции 