
&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	    Строка=ТекущийЭлемент.ТекущиеДанные;
		ИдЗадачиДляПоиска=ПолучитьДанныеИдЗадачиПоДокументу(Строка.ДокументОснование);
       Если ИдЗадачиДляПоиска=Неопределено Тогда 
			Сообщить("задача не найдена");
			Возврат
		КонецЕсли;
		КлючЗаписи=ПоискИСозданиеКлючаЗаписиПоИдЗадачи(ИдЗадачиДляПоиска);
		Если КлючЗаписи=Неопределено Тогда 
			Сообщить("задача не найдена");
			Возврат
		КонецЕсли;	
		ОткрытьФорму("Обработка.ДиспетчерЗадач.Форма.ФормаВыбораДействий",новый Структура("КлючЗаписи,ВыборДокумента",КлючЗаписи,Истина),ЭтаФорма);
		ТригерПриемаСканераШтрихКода=Ложь;
	КонецПроцедуры
	
&НаСервереБезКонтекста	
Функция ПоискИСозданиеКлючаЗаписиПоИдЗадачи(Знач ИдЗадачи)
	Если ТипЗнч(ИдЗадачи)=Тип("Строка") Тогда 
		ИдЗадачи=новый УникальныйИдентификатор(ИдЗадачи);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итЗадачиКРаспределению.ДокументОснование КАК ДокументОснование,
	|	итЗадачиКРаспределению.ТипЗадачи КАК ТипЗадачи,
	|	итЗадачиКРаспределению.ИдЗадачи КАК ИдЗадачи,
	|	итЗадачиКРаспределению.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	итЗадачиКРаспределению.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.итЗадачиКРаспределению КАК итЗадачиКРаспределению
	|ГДЕ
	|	итЗадачиКРаспределению.Состояние = ЗНАЧЕНИЕ(Перечисление.итWMSСостоянияЗадачТСД.КВыполнению)
	|	И итЗадачиКРаспределению.ИдЗадачи = &ИдЗадачи";
	
	Запрос.УстановитьПараметр("ИдЗадачи", ИдЗадачи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда 
		КлючЗаписи=РегистрыСведений.итЗадачиКРаспределению.СоздатьКлючЗаписи(новый Структура("ДокументОснование,ТипЗадачи,ИдЗадачи",ВыборкаДетальныеЗаписи.ДокументОснование,ВыборкаДетальныеЗаписи.ТипЗадачи,ВыборкаДетальныеЗаписи.ИдЗадачи));
		Возврат КлючЗаписи;
	КонецЕсли;
	Возврат Неопределено;
	
	
КонецФункции
	
&НаСервереБезКонтекста
Функция ПолучитьДанныеИдЗадачиПоДокументу(ДокументОснование)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	итЗадачиКРаспределению.ИдЗадачи КАК ИдЗадачи
		|ИЗ
		|	РегистрСведений.итЗадачиКРаспределению КАК итЗадачиКРаспределению
		|ГДЕ
		|	итЗадачиКРаспределению.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.ИдЗадачи;
	КонецЕсли;
	Возврат Неопределено;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;	
		 ОбработчкаПолученияДанныхШтрихКода(Параметр);
	 КонецЕсли;

 КонецПроцедуры
&НаКлиенте
 Процедура ОбработчкаПолученияДанныхШтрихКода(Параметр)
	 КонецПроцедуры

&НаКлиенте
Процедура КЗадачам(Команда)
Строка=Элементы.Список.ТекущиеДанные;
ОткрытьФорму("Документ.итНаборка.Форма.ФормаЗадачиКРаспределениюНаборки",новый Структура("ДокументОснование",Строка.ДокументОснование),ЭтаФорма);
ТригерПриемаСканераШтрихКода=Ложь;
 КонецПроцедуры

&НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
 МаршрутГУИД=Неопределено;
 Параметры.Свойство("МаршрутГУИД",МаршрутГУИД);
 Список.Параметры.УстановитьЗначениеПараметра("Реквизит1ГУИД",МаршрутГУИД);
 КонецПроцедуры

&НаСервереБезКонтекста
 Процедура ОбновитьНаСервере()
	СтруктураДанных=новый Структура;
	СлужебныеФункцииИПроцедурыКлиентСервер.СформироватьСтруктуруДанныхОПользователе(СтруктураДанных);
	СтруктураДанных.Вставить("ТипЗадачи",Перечисления.итWMSТипыЗадачТСД.Наборка);
	ОбработчикиЗапросаСервера.ОбновитьСписокЗадачКРаспределению(СтруктураДанных);

 КонецПроцедуры

&НаКлиенте
 Процедура Обновить(Команда)
	 ОбновитьНаСервере();
	 Элементы.Список.Обновить();
 КонецПроцедуры
