
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если не НеВозвращатьКонтрольНадТригером Тогда 
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	ПодтвердитьНаСервере();
	ОповеститьОВыборе(новый Структура("Действие,Строка","Подтверждена",ИдСтроки));
	ТригерПриемаСканераШтрихКода=Ложь;
	НеВозвращатьКонтрольНадТригером=Истина;
КонецПроцедуры
&НаСервере
Процедура ПодтвердитьНаСервере()
	НаборЗаписей=РегистрыСведений.ИтСтрокиЗадачНаТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдЗадачи.Установить(ИдЗадачи);
	НаборЗаписей.Отбор.ИдСтроки.Установить(ИдСтроки);
	НаборЗаписей.Прочитать();
	для Каждого стр из НаборЗаписей Цикл 
		ДанныеДокументаТСД=стр.ДанныеДокументаТСД.Получить();
		Если ТипЗнч(ДанныеДокументаТСД)=тип("Структура") тогда
			ДанныеДокументаТСД.Вставить("КоличествоФакт",стр.Количество);
		иначе
			ДанныеДокументаТСД=новый Структура("КоличествоФакт",стр.Количество);
		КонецЕсли;
		стр.ДанныеДокументаТСД=новый ХранилищеЗначения(ДанныеДокументаТСД);
	КонецЦикла;
	НаборЗаписей.Записать();
	КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("ИдСтроки") тогда
		Отказ=Истина;
		Возврат
	КонецЕсли;
	Если не Параметры.Свойство("ИдЗадачи") тогда
		Отказ=Истина;
		Возврат
	КонецЕсли;

	ИдЗадачи=Параметры.ИдЗадачи;
	ИдСтроки=Параметры.ИдСтроки;
	ПомарочныйУчет=Параметры.ПомарочныйУчет;
	ЗаполнитьИнформативнымиДанными();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьИнформативнымиДанными()
	НаборЗаписей=РегистрыСведений.ИтСтрокиЗадачНаТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдЗадачи.Установить(ИдЗадачи);
	НаборЗаписей.Отбор.ИдСтроки.Установить(ИдСтроки);
	НаборЗаписей.Прочитать();
	для Каждого стр из НаборЗаписей Цикл 
		НоменклатураПредставление=стр.НоменклатураПредставление;
		//ДанныеДокументаТСД=стр.ДанныеДокументаТСД.Получить();
		//Если ТипЗнч(ДанныеДокументаТСД)=тип("Структура") тогда 
		//	Если ДанныеДокументаТСД.Свойство("КоличествоФакт") Тогда
				Элементы.Декорация1.Заголовок="Количество  ="+стр.Количество;
			//КонецЕсли;
			
		//КонецЕсли;
    КонецЦикла;
	КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	Если ПомарочныйУчет Тогда 
		ЗаполнитьДаннымиМарокПоЗадаче();
	КонецЕсли;
	ОткрытьФорму("Документ.итНаборка.Форма.ФормаИзмененияСтроки",новый Структура("ИдЗадачи,ИдСтроки",ИдЗадачи,ИдСтроки),ЭтаФорма.ВладелецФормы);
	ТригерПриемаСканераШтрихКода=Ложь;
	НеВозвращатьКонтрольНадТригером=Истина;
	ЭтаФорма.Закрыть();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДаннымиМарокПоЗадаче()
	МассивЗадач=новый Массив;
	МассивЗадач.Добавить(ИдЗадачи);
	ОбработчикДанныхОбщиеФункцииИПроцедуры.ПолучитьДанныеМарокПоСпискуЗадач(МассивЗадач,Перечисления.итWMSТипыЗадачТСД.Наборка);
	КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры


