Функция ПолучитьТипШтрихкодаНаСервере(Стр) Экспорт
	Если СтрДлина(СокрЛП(Стр)) = 18 Тогда
		ТипШтрихКода=1; //Палет
	ИначеЕсли СтрДлина(СокрЛП(Стр)) = 20 Тогда
		Если Лев(СокрЛП(ШтрихКод),2) ="00" Тогда
			ТипШтрихКода=1; //Палет
		КонецЕсли; 
	ИначеЕсли СтрДлина(СокрЛП(Стр)) = 26 Тогда
		Если Сред(СокрЛП(Стр),13,1) ="2" или Сред(СокрЛП(Стр),13) ="4"  Тогда
			ТипШтрихКода=1; //Палет
		ИначеЕсли Сред(СокрЛП(Стр),13,1) ="1" или Сред(СокрЛП(Стр),13) ="3"  Тогда
			ТипШтрихКода=2; //Короб
		КонецЕсли; 
	ИначеЕсли СтрДлина(СокрЛП(Стр)) = 68 Тогда
		Если Лев(СокрЛП(Стр),3) ="22N"   Тогда
			ТипШтрихКода=3; //Бутылка
		КонецЕсли; 
	ИначеЕсли СтрДлина(СокрЛП(Стр)) = 150 Тогда
		ТипШтрихКода=3; //Бутылка
	Иначе
		ТипШтрихКода=0; //Неправильный штрихкод
	КонецЕсли;
	Возврат ТипШтрихКода;
КонецФункции

Процедура ПолучитьИнформациюПоШтрихКодуНаСервере() Экспорт
	ФлагВыполненияЗапроса=Истина;
    ФСтр = ШтрихКод;
 
  	СтруктураЗапроса = униОбщийМодуль.НоваяСтруктураЗапросакUWS("300000010");
	СтруктураЗапроса.Вставить("ШтрихКод",ШтрихКод);

	СтруктураЗапроса.Вставить("ИмяМетода","ПолучитьИнформациюПоШтрихКоду");

	Попытка
		ОтветСервера =  униОбщийМодуль.ДанныеИзUWS(СтруктураЗапроса);
	Исключение
		УспехАвторизации = Ложь;
		ОтветСервера = "Ошибка";
		сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
	ЕдиницыАП.Очистить();
	Палеты.Очистить();
	Короба.Очистить();
	ПоказыватьИнфоДоп=Ложь;
	Если ТипЗнч(ОтветСервера) = Тип("Структура") Тогда
		Если ОтветСервера.Свойство("Короба") Тогда
			Короба.Загрузить(ОтветСервера.Короба);
			 КонецЕсли;
		Если ОтветСервера.Свойство("ЕдиницыАП") Тогда
			ЕдиницыАП.Загрузить(ОтветСервера.ЕдиницыАП);
		КонецЕсли;
		Если ОтветСервера.Свойство("Инфо") Тогда
			Инфо=ОтветСервера.Инфо;
		КонецЕсли;
		Если ОтветСервера.Свойство("ИнфоДоп") Тогда
			ИнфоДоп=ОтветСервера.ИнфоДоп;
			ПоказыватьИнфоДоп=Истина;
		КонецЕсли;
		Если ОтветСервера.Свойство("ПоказыватьКороба") Тогда
			ПоказыватьКороба=ОтветСервера.ПоказыватьКороба;
		КонецЕсли;
		Если ОтветСервера.Свойство("ПоказыватьКороба") Тогда
			ПоказыватьФСМ=ОтветСервера.ПоказыватьФСМ;
		КонецЕсли;
	КонецЕсли;
	ФлагВыполненияЗапроса=Ложь;
КонецПроцедуры
