
&НаКлиенте
Процедура Да(Команда)
	ВладелецФормы.ЗакончитьАгрегациюОповещение(КодВозвратаДиалога.Да,Неопределено);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Нет(Команда)
	ВладелецФормы.ЗакончитьАгрегациюОповещение(КодВозвратаДиалога.Нет,Неопределено);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("МассивРасхождений") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;
	для Каждого стр из Параметры.МассивРасхождений цикл
		ЗаполнитьЗначенияСвойств(ТаблицаРасхождений.Добавить(),стр);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасхожденийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму(Элемент.Текущиеданные.НоменклатураПредставление);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры
