
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
	
	/////++Заполнение номенклатуры в ячейке с остатком отличным от 0,для быстрого подбора при санировании 
	НоменклатураВЯчейкеПоБазе.Очистить();
	Для Каждого Стр из ВладелецФормы.СоставЯчейкиБезУчетаSSCC цикл
		МассивСтрок= НоменклатураВЯчейкеПоБазе.НайтиСтроки(новый Структура("Номенклатура",Стр.Номенклатура));
		Если МассивСтрок.Количество()>0 Тогда 
			Продолжить;
		КонецЕсли;
		СтрокаДобавления=НоменклатураВЯчейкеПоБазе.Добавить();
		СтрокаДобавления.Номенклатура=Стр.Номенклатура;
		СтрокаДобавления.ДатаРозлива=Стр.ДатаРозлива;
	КонецЦикла;
	/////--Заполнение номенклатуры в ячейке с остатком отличным от 0,для быстрого подбора при санировании 

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;	
		ОбработатьДанныеШтрихКода(Параметр)
	КонецЕсли;
	
	
КонецПроцедуры
&НаКлиенте
Процедура СоставЯчейкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	СтруктураПараметров=новый Структура;
	СтруктураПараметров.Вставить("ИдСтроки",ТекущийЭлемент.ТекущиеДанные.ИдСтроки);
	СтруктураПараметров.Вставить("Номенклатура",ТекущийЭлемент.ТекущиеДанные.Номенклатура);
	СтруктураПараметров.Вставить("НоменклатураПредставление",ТекущийЭлемент.ТекущиеДанные.НоменклатураПредставление);
	СтруктураПараметров.Вставить("ИдентификаторУпаковки",ТекущийЭлемент.ТекущиеДанные.ИдентификаторУпаковки);
	СтруктураПараметров.Вставить("КоличествоФакт",ТекущийЭлемент.ТекущиеДанные.КоличествоФакт);
	СтруктураПараметров.Вставить("ДатаРозлива",ТекущийЭлемент.ТекущиеДанные.ДатаРозлива);
	СтруктураПередаваемыхДанных=новый Структура("СтруктураПередаваемыхДанных",СтруктураПараметров);
	ОткрытьФорму("Обработка.ОбработчикИнвентаризацииЯчейки.Форма.ФормаРедактированияДанныхСтроки",СтруктураПередаваемыхДанных,ЭтаФорма);
	ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры
#КонецОбласти





#Область ОбработчикиКоманд
&НаКлиенте
Процедура Подтвердить(Команда)
для Каждого Строка из СоставЯчейки цикл
МассивСтрок=ВладелецФормы.СоставЯчейки.НайтиСтроки(Новый Структура("Номенклатура,ИдентификаторУпаковки,ДатаРозлива",Строка.Номенклатура,Строка.ИдентификаторУпаковки,Строка.ДатаРозлива));
Если МассивСтрок.Количество()>0 тогда
	МассивСтрок[0].КоличествоФакт=МассивСтрок[0].КоличествоФакт+Строка.КоличествоФакт;
иначе
	 ЗаполнитьЗначенияСвойств(ВладелецФормы.СоставЯчейки.Добавить(),Строка);
 КонецЕсли; 
КонецЦикла;
ВладелецФормы.ОбработкаСоставЯчейкиБезУчетаSSCCКлиент();
ЭтаФорма.Закрыть();


КонецПроцедуры
&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
&НаКлиенте
Процедура Удалить(Команда)
	Если ТекущийЭлемент.Имя="СоставЯчейки" тогда
		ИдентификаторСтроки=ТекущийЭлемент.ТекущиеДанные.ПолучитьИдентификатор();
		Строка = СоставЯчейки.НайтиПоИдентификатору(ИдентификаторСтроки);
		СоставЯчейки.Удалить(Строка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти





#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВидимостьИДоступностьЭлементовКлиент()
	ВидимостьИДоступностьЭлементовСервер();
КонецПроцедуры
&НаСервере
Процедура ВидимостьИДоступностьЭлементовСервер()
	Если Элементы.ДекорацияЭтап.Заголовок="Сканируйте SSCC" тогда
		Элементы.СоставЯчейки.Видимость=Ложь;
	иначе
		Элементы.СоставЯчейки.Видимость=Истина;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьДанныеШтрихКода(Параметр)
	Если Элементы.ДекорацияЭтап.Заголовок="Сканируйте штрих-код номенклатуры для добавления" тогда
		ПолучитьДанныеНоменклатурыПоШтрихКоду(Параметр)	
	КонецЕсли;
	
	Если Элементы.ДекорацияЭтап.Заголовок="Сканируйте SSCC" тогда
		ЗарегестрироватьSSCCДляДобавления(Параметр);		
	КонецЕсли;	
КонецПроцедуры
&НаСервере
Процедура ПолучитьДанныеНоменклатурыПоШтрихКоду(Параметр)
СтруктураДанных=ОбработчикиЗапросаСервера.ЗапроситьДанные(новый Структура("ТипОбработкиДанных,КлючПолученияДанных","ПолучитьДанныеПоНоменклатуре",Параметр),"Inventory");
Если СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных,"Номенклатура") тогда
	Возврат
КонецЕсли;	
Если не ТипЗнч(СтруктураДанных.Номенклатура)=Тип("Массив") Тогда 
	Сообщить("Не верный формат данных");
	Возврат
КонецЕсли;
Если СтруктураДанных.Номенклатура.Количество()=0 Тогда 
	Сообщить("нет данных");
	Возврат
КонецЕсли;	

ИдСтрокиКакКлюч=Неопределено;
Для Каждого стр из СтруктураДанных.Номенклатура цикл 
МассивСтрокНайденойНоменклатуры=НоменклатураВЯчейкеПоБазе.НайтиСтроки(новый Структура("Номенклатура",стр.Номенклатура));
Если МассивСтрокНайденойНоменклатуры.Количество()>0 тогда
НоваяСтрока=СоставЯчейки.Добавить();
НоваяСтрока.ИдСтроки=новый УникальныйИдентификатор;
НоваяСтрока.ИдентификаторУпаковки=SSCC;
НоваяСтрока.Номенклатура=стр.Номенклатура;
НоваяСтрока.ДатаРозлива=МассивСтрокНайденойНоменклатуры[0].ДатаРозлива;
НоваяСтрока.НоменклатураПредставление=стр.НоменклатураПредставление;
НоваяСтрока.КоличествоФакт=стр.Количество;
ИдСтрокиКакКлюч=НоваяСтрока.ИдСтроки;
Прервать;
КонецЕсли;
КонецЦикла;
Если ИдСтрокиКакКлюч=Неопределено Тогда 
НоваяСтрока=СоставЯчейки.Добавить();
НоваяСтрока.ИдСтроки=новый УникальныйИдентификатор;
НоваяСтрока.ИдентификаторУпаковки=SSCC;
НоваяСтрока.Номенклатура=СтруктураДанных.Номенклатура[0].Номенклатура;
НоваяСтрока.НоменклатураПредставление=СтруктураДанных.Номенклатура[0].НоменклатураПредставление;
НоваяСтрока.КоличествоФакт=СтруктураДанных.Номенклатура[0].Количество;
ИдСтрокиКакКлюч=НоваяСтрока.ИдСтроки;
КонецЕсли;
//////////Заполнение Спика выбора к строке
Для Каждого стр из СтруктураДанных.Номенклатура цикл
	НоваяСтрока=ДанныеВыбораДляСроки.Добавить();
	НоваяСтрока.ИдСтроки=ИдСтрокиКакКлюч;
	НоваяСтрока.ИдСтрокиПредставление=Строка(ИдСтрокиКакКлюч);
	НоваяСтрока.Номенклатура=стр.Номенклатура;
	НоваяСтрока.НоменклатураПредставление=стр.НоменклатураПредставление;
КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗарегестрироватьSSCCДляДобавления(ИдентификаторУпаковки)
	Отказ=Ложь;
	ОбщийМодульКлиентскойЧасти.ПроверитьSSCCНаЛеквидность(ИдентификаторУпаковки,Отказ);
	Если Отказ тогда
		Сообщить("Формат штрих кода не соответствует SSCC");
        Возврат
	КонецЕсли;	
	SSCC=ИдентификаторУпаковки;
	Элементы.ДекорацияЭтап.Заголовок="Сканируйте штрих-код номенклатуры для добавления";

КонецПроцедуры

#КонецОбласти




