&НаСервере
Перем ПодчЭлементы; 
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТригерПриемаСканераШтрихКода = Истина;
	Элементы.ЗавершитьОбработку.ЦветФона = WebЦвета.Лосось;
    Элементы.ЗавершитьОбработку.Доступность = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если  ИмяСобытия="ОбработчикШтрихКода" и Источник="ОбработчикШтрихКода" тогда
		ШтрихКодУчета =Параметр;
		ТипШК = униОбщийМодуль.ОпрределитьТипСчитанногоШК(ШтрихКодУчета);
		Если ТипШК = "Короб" или ТипШК = "СборныйКороб" Тогда
		
			 КодКороба = ШтрихКодУчета;
		     
		КонецЕсли; 
 		Если ТипШК = "ФСМ2012" или ТипШК = "ФСМ2018" Тогда
	
			 КодФСМ = ШтрихКодУчета;
		
		КонецЕсли; 

	КонецЕсли;
	
	Если Не ПустаяСтрока(КодКороба) И Не ПустаяСтрока(КодФСМ) Тогда
	
		   ПроверкаВхождения();
	
	КонецЕсли; 
	
	Если ИмяСобытия="ОбработчикШтрихКода" и Источник="ОшибкаЧтения" тогда
		Сообщить("ошибка чтения штрих-кода");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПроверкаВхождения()
		
	   СтруктураОтбора = Новый Структура("Идентификатор,ИдентификаторКороба,ИдентификаторПалета",КодФСМ,КодКороба,КодПалета);
	   ПодчЭлементы = ПолучитьИзВременногоХранилища(АдресХраненияДанныхПроверки);
	   Строки = ПодчЭлементы.НайтиСтроки(СтруктураОтбора);
	   УспехПроверки = (Строки.Количество()>0);
	   Если УспехПроверки Тогда
	         Элементы.ЗавершитьОбработку.Доступность = Истина;
			 Элементы.ЗавершитьОбработку.ЦветФона = WebЦвета.БледноЗеленый
	   	
	   
	   КонецЕсли; 
	   
   КонецПроцедуры
 
&НаСервере
 Процедура ПолучитьЭлементыКонтроля()
 	СтруктураЗапроса = униОбщийМодуль.НоваяСтруктураЗапросакUWS();
	СтруктураЗапроса.Вставить("КодыНаборки",КодПалета+символы.ПС);
	
	СтруктураЗапроса.Вставить("ИмяМетода","ВернутьПодчиненныеЭлементы");
	СтруктураЗапроса.Вставить("ГУИД","11");

	Попытка
		ОтветСервера =  униОбщийМодуль.ДанныеИзUWS(СтруктураЗапроса);
	Исключение
		УспехАвторизации = Ложь;
		ОтветСервера = "Ошибка";
	КонецПопытки; 
	
	Если ТипЗнч(ОтветСервера) = Тип("Структура") Тогда
		Если ОтветСервера.подчиненныеКоды.Количество()>0 Тогда
			СтрДанных = ОтветСервера.подчиненныеКоды[0];
			ИнфоПоле = ""+СтрДанных.Наименование+" дата.р:"+Формат(СтрДанных.ДатаРозлива,"ДФ=dd.MM.yy")+" код Е:"+СокрлП(СтрДанных.КодАП)
			 	+" всего:" +СтрДанных.КоличествоВПалете;
				ПодчЭлементы = ОтветСервера.подчиненныеКоды;
		КонецЕсли; 
    АдресХраненияДанныхПроверки = ПоместитьВоВременноеХранилище(ПодчЭлементы,ЭтаФорма.УникальныйИдентификатор);
    КонецЕсли;
 КонецПроцедуры
  


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("КодПалета") Тогда
         КодПалета =  Параметры.КодПалета;
    КонецЕсли; 
	
	ПолучитьЭлементыКонтроля();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОбработку(Команда)
	 ПараметрФормы = Новый Структура("КодПалета,КодКороба,КодФСМ,УспехПроверки",КодПалета,КодКороба,КодФСМ,УспехПроверки);
	 ЭтаФорма.Закрыть(ПараметрФормы);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлементИзНаборки(Команда)
	 ПараметрФормы = Новый Структура("КодПалета,КодКороба,КодФСМ,УспехПроверки",КодПалета,КодКороба,"Удалить строку элемента",Ложь);
	 ЭтаФорма.Закрыть(ПараметрФормы);
КонецПроцедуры
