
&НаКлиенте
Процедура ЯчейкаПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
СтандартнаяОбработка=Ложь;
#Если МобильноеПриложениеКлиент  тогда
	МодульМобильныхДивайсовКлиент.СканированиеКамерой(ЭтаФорма,"ШтрихКодЯчейки","ПолучитьЯчейкуКлиент");
#КонецЕсли	
КонецПроцедуры
&НаКлиенте
Процедура  ПолучитьЯчейкуКлиент() Экспорт 
	ПолучениеДанныеЯчейки(ШтрихКодЯчейки);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;
		ПолучениеДанныеЯчейки(Параметр)
		КонецЕсли;

 КонецПроцедуры
&НаСервере 
Процедура ПолучениеДанныеЯчейки(ШтрихКод)
	Если ПопыткаСканирования=2 Тогда 
		ПопыткаСканирования=0;
		ШкЯчейкиНакопительный="";
	КонецЕсли;	
	
	Если ПопыткаСканирования=1 Тогда 
		ШтрихКод=ШкЯчейкиНакопительный+"-"+ШтрихКод;
	КонецЕсли;
	//СлужебныеФункцииИПроцедурыКлиентСервер.ДобавитьВЛог(,"#СканированиеЯчейки получение данных",);
	СтруктураДанных=новый Структура;
	СлужебныеФункцииИПроцедурыКлиентСервер.СформироватьСтруктуруДанныхОПользователе(СтруктураДанных);
	СтруктураДанных.Вставить("КлючОперации","ЯчейкаПоШтрихКоду");
	СтруктураДанных.Вставить("Данные",НРег(ШтрихКод));
	СтруктураДанных=ОбработчикиЗапросаСервера.ЗапроситьДанные(СтруктураДанных,"ServiceFunction");
		//СлужебныеФункцииИПроцедурыКлиентСервер.ДобавитьВЛог(,"данные о сканировании ячейки",);
	Статус=Неопределено;
	СтруктураДанных.Свойство("Статус",Статус);
	Если ПопыткаСканирования=0 и Статус=404 Тогда 
		//СлужебныеФункцииИПроцедурыКлиентСервер.ДобавитьВЛог(,"#СканированиеЯчейки данных нет накопление штрих кода",);
		ШкЯчейкиНакопительный=ШтрихКод;	
		ПопыткаСканирования=ПопыткаСканирования+1;
		Возврат;
	КонецЕсли;
	Если 	СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных,"Ячейка") тогда
		Возврат
	КонецЕсли;	
	Если СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных,"ЯчейкаПредставление") тогда
		Возврат
	КонецЕсли;
	//СлужебныеФункцииИПроцедурыКлиентСервер.ДобавитьВЛог(,"#СканированиеЯчейки Ячейка получена",);
	Ячейка=СтруктураДанных.Ячейка;
	ЯчейкаПредставление=СтруктураДанных.ЯчейкаПредставление;
	ПопыткаСканирования=0;	
    ШкЯчейкиНакопительный="";
 КонецПроцедуры

&НаКлиенте
 Процедура Назад(Команда)
	 ЭтаФорма.Закрыть();
 КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ОповеститьОВыборе(новый Структура("Ячейка,ЯчейкаПредставление",Ячейка,ЯчейкаПредставление));
	 //ВладелецФормы[Параметры.ПолеПолучательИдентификатор]=Ячейка;
	 //ВладелецФормы[Параметры.ПолеПолучательПредставление]=ЯчейкаПредставление;
	 //ЭтаФорма.Закрыть();
 КонецПроцедуры
