
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СканироватьВФайлНаСервере(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаСканированияШтрихКодов",,ЭтаФорма);
	ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АгрегацияМарок(Команда)
	ОткрытьФорму("Документ.итДокументСвободнойАгрегации.Форма.ФормаСписка",,ЭтаФорма);
	ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацияЯчейки(Команда)
	ОткрытьФорму("Обработка.ОбработчикИнвентаризацииЯчейки.Форма.ФормаОбработки");
	ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Ревизор(Команда)
	ОткрытьФорму("Обработка.ОбработкаРевизор.Форма.Форма");
	ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РучнаяНаборка(Команда)
	ОткрытьФорму("Документ.итРучнаяНаборка.Форма.ФормаСписка",,ЭтаФорма);
	ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РучноеПеремещение(Команда)
	ОткрытьФорму("Документ.итРучноеПеремещение.Форма.ФормаСписка",,ЭтаФорма);
	ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикетки(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаПечатиЭтикеткиГрупповойТары",,ЭтаФорма);
	ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КонтрольОтгрузки(Команда)
	ОткрытьФорму("Документ.итКонтрольОтгрузки.Форма.ФормаСписка",,ЭтаФорма);
	ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РаботаСКарточкойНоменклатуры(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаПрисвоенияШкКарточкеНМ",,ЭтаФорма);
	ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры
