
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("ИдентификаторСтроки") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;	
	Если не Параметры.Свойство("Количество") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;
	Если не Параметры.Свойство("КоличествоМаксимум") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;
	Если не Параметры.Свойство("Номенклатура") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;
	Если не Параметры.Свойство("НоменклатураПредставление") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;
	Если не Параметры.Свойство("СерияНоменклатуры") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;

	Если не Параметры.Свойство("СерияНоменклатурыПредставление") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;
ИдентификаторСтроки=Параметры.ИдентификаторСтроки;
Количество=Параметры.Количество;
КоличествоМаксимум=Параметры.Количество;
Номенклатура=Параметры.Номенклатура;
НоменклатураПредставление=Параметры.НоменклатураПредставление;
СерияНоменклатуры=Параметры.СерияНоменклатуры;
СерияНоменклатурыПредставление=Параметры.СерияНоменклатурыПредставление;

КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ОповеститьОВыборе(новый Структура("ИдентификаторСтроки,Количество",ИдентификаторСтроки,Количество));
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Если Количество>КоличествоМаксимум Тогда 
		Количество=КоличествоМаксимум;
		Сообщить("Количество не может быть больше чем в паллете");
	КонецЕсли;	
КонецПроцедуры
