
&НаКлиенте
Процедура НоваяОперация(Команда)
	ОткрытьФорму("Документ.униПоместитьВЯчейку.Форма.ФормаДокумента");
КонецПроцедуры

&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ИнфоПоСмене.Параметры.УстановитьЗначениеПараметра("Дата1",ГраницаСмены(Истина));
	ИнфоПоСмене.Параметры.УстановитьЗначениеПараметра("Дата2",ГраницаСмены(Ложь));

КонецПроцедуры

&НаКлиенте
Функция ГраницаСмены(ЭтоНачало)
	ВосемьУтра = НачалоДня(ТекущаяДата())+8*3600;
	ВосемьВечера = НачалоДня(ТекущаяДата())+20*3600;
	
		Если ТекущаяДата()>ВосемьУтра И ТекущаяДата()<ВосемьВечера Тогда
		    НачалоСмены = ВосемьУтра;
			КонецСмены =  ВосемьУтра + 12*3600;
		ИначеЕсли ТекущаяДата()>=ВосемьВечера  Тогда
			НачалоСмены =  ВосемьВечера;
			КонецСмены = НачалоСмены+12*3600;
		иначе
			НачалоСмены =  ВосемьУтра - 12*3600;
			КонецСмены = ВосемьУтра;
		КонецЕсли; 
	    Если ЭтоНачало Тогда
		     Возврат НачалоСмены;
		иначе	
		     Возврат КонецСмены;
		КонецЕсли; 

КонецФункции // ()
 