
&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДанныеПечатнойФормы") Тогда 
		ТабличныйДокумент=Параметры.ДанныеПечатнойФормы;
		Если ТабличныйДокумент.НайтиТекст("{ШаблонСотрудника}") <> Неопределено Тогда  
			Область=ТабличныйДокумент.НайтиТекст("{ШаблонСотрудника}");
			Область.Текст=СтрЗаменить(Область.Текст,"{ШаблонСотрудника}",ПараметрыСеанса.ТекущийПользователь);
		КонецЕсли;
		ПечатнаяФорма.Вывести(ТабличныйДокумент);
	КонецЕсли;	
КонецПроцедуры

