
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.НоменклатураПредставление.РежимВыбораИзСписка=Истина;
	Если Параметры.Свойство("СтруктураПередаваемыхДанных") тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры.СтруктураПередаваемыхДанных);
		//Элементы.НоменклатураПредставление.СписокВыбора.Добавить(Строка(Параметры.СтруктураПередаваемыхДанных.Номенклатура),Параметры.СтруктураПередаваемыхДанных.НоменклатураПредставление);
		НоменклатураПредставление=Строка(Параметры.СтруктураПередаваемыхДанных.Номенклатура);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
    МассивСтрокВыбора=ЭтаФорма.ВладелецФормы.ДанныеВыбораДляСроки.НайтиСтроки(новый Структура("ИдСтроки",ИдСтроки));
	Элементы.НоменклатураПредставление.СписокВыбора.Очистить();
	для Каждого стр из МассивСтрокВыбора цикл
		Элементы.НоменклатураПредставление.СписокВыбора.Добавить(Строка(стр.Номенклатура),стр.НоменклатураПредставление);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	МассивСтрокКИзменению=ЭтаФорма.ВладелецФормы.СоставЯчейки.НайтиСтроки(новый Структура("ИдСтроки",ИдСтроки));
	НоменклатураПредставлениеЭлементСписка=Элементы.НоменклатураПредставление.СписокВыбора.НайтиПоЗначению(НоменклатураПредставление);
	Если НоменклатураПредставлениеЭлементСписка=Неопределено Тогда 
		Сообщить("Ошибка подставновки данных");
		Возврат
	КонецЕсли;
	
	для Каждого стр из МассивСтрокКИзменению цикл
		стр.Номенклатура=Номенклатура;
		стр.НоменклатураПредставление=НоменклатураПредставлениеЭлементСписка.Представление;
		стр.КоличествоФакт=КоличествоФакт;
		стр.ДатаРозлива=ДатаРозлива;
		стр.ИдентификаторУпаковки=ИдентификаторУпаковки;
	КонецЦикла;
	ЭтаФорма.Закрыть();
КонецПроцедуры
