
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("Ссылка") Тогда 
		Возврат
	КонецЕсли;	
	Данные=Параметры.Ссылка.СтруктураКраткогоСодежимого.Получить();
	ТаблицаДанных.Очистить();
	Для Каждого стр из Данные.ТаблицаДанных цикл
		НоваяСтрока=ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
	КонецЦикла;
	Контрагент=Данные.Контрагент;
	ДатаОтгрузки=Данные.Датаотгрузки;
	ВремяОтгрузки=Данные.ВремяПогрузки;
	КоличествоИтого=Данные.КоличествоИтого;
	КоличествоМестИтого=Данные.КоличествоМестИтого;
	КоличествоПаллетИтого=Данные.КоличествоПаллет;
	ТекущаяСтрока=1;
	ВсегоСтраницСтроки=ТаблицаДанных.Количество();
	ЗаполнитьДаннымиТекущейСтроки();
КонецПроцедуры

Процедура ЗаполнитьДаннымиТекущейСтроки()
	Строка=ТаблицаДанных[ТекущаяСтрока-1];
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Строка);
	ВидимостьДоступностьСервер();
	КонецПроцедуры

&НаКлиенте
Процедура ВидимостьДоступностьКлиент()
	ВидимостьДоступностьСервер();
КонецПроцедуры
&НаСервере
Процедура ВидимостьДоступностьСервер()
	Если ТекущаяСтрока=ВсегоСтраницСтроки Тогда 
		Элементы.Далее.Видимость=Ложь;
	иначе
		Элементы.Далее.Видимость=Истина;
	КонецЕсли;	
	Если ТекущаяСтрока=1 Тогда 
		Элементы.Вернуться.Видимость=Ложь;
	иначе
		Элементы.Вернуться.Видимость=Истина;
	КонецЕсли;
	Элементы.ДекорацияКоличествоИз.Заголовок=Строка(ТекущаяСтрока) +" из "+ Строка(ВсегоСтраницСтроки);
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	Если ТекущаяСтрока<ВсегоСтраницСтроки Тогда 
		 ТекущаяСтрока=ТекущаяСтрока+1;
	 КонецЕсли;
	 ЗаполнитьДаннымиТекущейСтроки();
КонецПроцедуры

&НаКлиенте
Процедура Вернуться(Команда)
	Если ТекущаяСтрока>1 Тогда 
		ТекущаяСтрока=ТекущаяСтрока-1;
	КонецЕсли;
	ЗаполнитьДаннымиТекущейСтроки();
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
