
&НаКлиенте
Процедура Добавить(Команда)
Ссылка=	ДобавитьНаСервере();
ОткрытьФорму("Документ.итКонтрольОтгрузки.Форма.ФормаДокумента",новый Структура("Ключ",Ссылка),ЭтаФорма);
ТригерПриемаСканераШтрихКода=Ложь;

КонецПроцедуры
&НаСервере
Функция  ДобавитьНаСервере()
	НовыйОбъект =Документы.итКонтрольОтгрузки.СоздатьДокумент();
	НовыйОбъект.Дата=ТекущаяДата();
	НовыйОбъект.Записать();
	Возврат НовыйОбъект.Ссылка;
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Документ.итКонтрольОтгрузки.Форма.ФормаДокумента",новый Структура("Ключ",ВыбраннаяСтрока),ЭтаФорма);
	ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры
